MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32TG842F8/mcu.h
typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EFM32TG842F8_Part */

/***************************************************************************//**
 * @defgroup EFM32TG842F8_Peripheral_TypeDefs EFM32TG842F8 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "efm32tg_aes.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_dma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_dma.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_msc.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_emu.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_rmu.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_cmu.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_usart.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_timer.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_vcmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_prs.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_adc.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_dac.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_lcd.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_romtable.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg_calibrate.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFM32TG842F8_Peripheral_TypeDefs */

/***************************************************************************//**
 * @defgroup EFM32TG842F8_Peripheral_Base EFM32TG842F8 Peripheral Memory Map
 * @{
 ******************************************************************************/

#define AES_BASE          (0x400E0000UL) /**< AES base address  */
#define DMA_BASE          (0x400C2000UL) /**< DMA base address  */
#define MSC_BASE          (0x400C0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400C6000UL) /**< EMU base address  */
#define RMU_BASE          (0x400CA000UL) /**< RMU base address  */
#define CMU_BASE          (0x400C8000UL) /**< CMU base address  */
#define LESENSE_BASE      (0x4008C000UL) /**< LESENSE base address  */
#define RTC_BASE          (0x40080000UL) /**< RTC base address  */
#define ACMP0_BASE        (0x40001000UL) /**< ACMP0 base address  */
#define ACMP1_BASE        (0x40001400UL) /**< ACMP1 base address  */
#define USART0_BASE       (0x4000C000UL) /**< USART0 base address  */
#define USART1_BASE       (0x4000C400UL) /**< USART1 base address  */
#define TIMER0_BASE       (0x40010000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40010400UL) /**< TIMER1 base address  */
#define GPIO_BASE         (0x40006000UL) /**< GPIO base address  */
#define VCMP_BASE         (0x40000000UL) /**< VCMP base address  */
#define PRS_BASE          (0x400CC000UL) /**< PRS base address  */
#define LEUART0_BASE      (0x40084000UL) /**< LEUART0 base address  */
#define LETIMER0_BASE     (0x40082000UL) /**< LETIMER0 base address  */
#define PCNT0_BASE        (0x40086000UL) /**< PCNT0 base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define DAC0_BASE         (0x40004000UL) /**< DAC0 base address  */
#define I2C0_BASE         (0x4000A000UL) /**< I2C0 base address  */
#define LCD_BASE          (0x4008A000UL) /**< LCD base address  */
#define WDOG_BASE         (0x40088000UL) /**< WDOG base address  */
#define CALIBRATE_BASE    (0x0FE08000UL) /**< CALIBRATE base address */
#define DEVINFO_BASE      (0x0FE081B0UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xE00FFFD0UL) /**< ROMTABLE base address */
#define LOCKBITS_BASE     (0x0FE04000UL) /**< Lock-bits page base address */
#define USERDATA_BASE     (0x0FE00000UL) /**< User data page base address */

